In [2]:
# importing python basic package 

import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings('ignore')
%matplotlib inline

In [4]:
mydata = pd.read_excel('D:\EDA\Employee data\Employee_Data.xls')

In [5]:
data = mydata.copy()

In [6]:
mydata.head()

,Employee Id,First Name,Last Name,Department,Age,Experience,Salary
0,1,Joy,Bass,Sales and Marketing,28.0,3.0,32889
1,2,Sheila,Garza,Sales and Marketing,22.0,1.0,15944
2,3,John,Bryant,Customer Relations,22.0,1.0,40343
3,4,Christian,Farley,Customer Relations,22.0,1.0,19018
4,5,Colorado,Bowen,Accounting,27.0,0.0,24795

In [7]:
data.head()

,Employee Id,First Name,Last Name,Department,Age,Experience,Salary
0,1,Joy,Bass,Sales and Marketing,28.0,3.0,32889
1,2,Sheila,Garza,Sales and Marketing,22.0,1.0,15944
2,3,John,Bryant,Customer Relations,22.0,1.0,40343
3,4,Christian,Farley,Customer Relations,22.0,1.0,19018
4,5,Colorado,Bowen,Accounting,27.0,0.0,24795

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Employee Id  100 non-null    int64
 1   First Name   100 non-null    object
 2   Last Name    100 non-null    object
 3   Department   81 non-null     object
 4   Age          82 non-null     float64
 5   Experience   90 non-null     float64
 6   Salary       100 non-null    int64
dtypes: float64(2), int64(2), object(3)
memory usage: 5.6+ KB

In [9]:
data.describe()

       Employee Id        Age  Experience        Salary
count   100.000000  82.000000   90.000000    100.000000
mean     50.500000  37.975610   14.766667  65066.760000
std      29.011492   9.515388    6.889252  26189.874212
min       1.000000  22.000000    0.000000  11830.000000
25%      25.750000  27.250000    9.250000  48526.000000
50%      50.500000  42.000000   16.500000  73500.500000
75%      75.250000  45.750000   21.000000  86621.250000
max     100.000000  50.000000   25.000000  98180.000000

In [10]:
# checking the missing data 
data.isnull().sum()

Employee Id     0
First Name      0
Last Name       0
Department     19
Age            18
Experience     10
Salary          0
dtype: int64

In [11]:
data.columns

Index(['Employee Id', 'First Name', 'Last Name', 'Department', 'Age',
       'Experience', 'Salary'],
      dtype='object')

In [16]:
data['Department'].value_counts()

Department
Sales and Marketing    30
Accounting             27
Customer Relations     24
Name: count, dtype: int64

In [17]:
data['Department']= data['Department'].fillna('Sales and Marketing')

In [18]:
data['Department'].value_counts()

Department
Sales and Marketing    49
Accounting             27
Customer Relations     24
Name: count, dtype: int64